tiiuae/contiki-ng/arch/cpu/gecko2/radio/efr32-radio-IEEE802154_GB920MHz.c
/*
 * Copyright (c) 2018-2019, RISE SICS
 * Copyright (C) 2022 Yago Fontoura do Rosario <yago.rosario@hotmail.com.br>
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*
 * \author
 *      Yago Fontoura do Rosario <yago.rosario@hotmail.com.br>
 *      Yevgen Gyl <yevgen.gyl@tii.ae>
 */
#include "contiki.h"
#include "dev/radio.h"
#include "net/packetbuf.h"
#include "net/netstack.h"
#include "em_core.h"
#include "em_system.h"

#include "efr32-radio-buffer.h"

#include "pa_conversions_efr32.h"
#include "sl_rail_util_dma.h"
#include "sl_rail_util_pti.h"
#include "sl_rail_util_rf_path.h"
#include "sl_rail_util_rf_path_switch.h"
#include "sl_rail_util_rssi.h"
#include "rail.h"
#include <ieee802154/rail_ieee802154.h>
#include "sl_rail_util_init_inst0_config.h"
#include <sli_rail_util_callbacks.h>
#include "sl_rail_util_protocol.h"
#include <sl_flex_rail_package_assistant.h>
#include "sl_flex_rail_package_assistant_config.h"
#include "rail_config_IEEE802154_GB920MHz.h"

/* Log configuration */
#include "sys/log.h"
#define LOG_MODULE "EFR32-GB920"
#define LOG_LEVEL LOG_LEVEL_NONE

enum {
  IEEE802154_ACK_REQUEST     = 1 << 5,
};

typedef enum {
  TX_IDLE,
  TX_SENDING,
  TX_SENT,
  TX_NO_ACK,
  TX_CHANNEL_BUSY,
  TX_ERROR
} tx_status_t;

/* 920.80 Mhz - 932.80 Mhz, channel space 600kHz */
#define CHANNEL_MIN            0x00
#define CHANNEL_MAX            0x14
#define PTI_ENABLED            false

static void rail_events_cb(RAIL_Handle_t rail_handle, RAIL_Events_t events);
static RAIL_Config_t rail_config = {
  .eventsCallback = &rail_events_cb,
  // Other fields are ignored nowadays
};
static union {
  RAIL_FIFO_ALIGNMENT_TYPE align[RAIL_FIFO_SIZE / RAIL_FIFO_ALIGNMENT];
  uint8_t fifo[RAIL_FIFO_SIZE];
} sRailRxFifo;
static RAIL_Handle_t sRailHandle = RAIL_EFR32_HANDLE;
static RAIL_Time_t last_rx_time = 0;
static int16_t last_rssi;
static int16_t last_lqi;
/* The process for receiving packets. */
PROCESS(efr32_radio_process_920, "efr32 radio driver");
static uint8_t send_on_cca = 1;
static uint8_t poll_mode = 0;
static RAIL_DataConfig_t data_config = {
  .txSource = TX_PACKET_DATA,
  .rxSource = RX_PACKET_DATA,
  .txMethod = PACKET_MODE,
  .rxMethod = PACKET_MODE,
};
static RAIL_IEEE802154_Config_t rail_ieee802154_config = {
  .addresses = NULL,
  .ackConfig = {
    .enable = true,
    .ackTimeout = 672,
    .rxTransitions = {
      .success = RAIL_RF_STATE_RX,
      .error = RAIL_RF_STATE_IDLE
    },
    .txTransitions = {
      .success = RAIL_RF_STATE_RX,
      .error = RAIL_RF_STATE_IDLE
    }
  },
  .timings = {
    .idleToRx = 100,
    .idleToTx = 100,
    .rxToTx = 192,
    .txToRx = 192 - 10, 
     // Make txToRx slightly lower than desired to make sure we get to
     // RX in time
    .rxSearchTimeout = 0, // Not used
    .txToRxSearchTimeout = 0, // Not used
  },
  .framesMask = RAIL_IEEE802154_ACCEPT_STANDARD_FRAMES
    | RAIL_IEEE802154_ACCEPT_ACK_FRAMES,
  .promiscuousMode = false, // Enable format and address filtering.
  .isPanCoordinator = false,
  .defaultFramePendingInOutgoingAcks = false,
};
static union {
  RAIL_FIFO_ALIGNMENT_TYPE align[RAIL_FIFO_SIZE / RAIL_FIFO_ALIGNMENT];
  uint8_t fifo[RAIL_FIFO_SIZE];
} sRailTxFifo;
static uint16_t panid = 0xabcd;
static int channel = IEEE802154_DEFAULT_CHANNEL;
static int cca_threshold = -85;
static RAIL_TxOptions_t txOptions = RAIL_TX_OPTIONS_DEFAULT;
static volatile tx_status_t tx_status;
static volatile bool is_receiving = false;
/*---------------------------------------------------------------------------*/
static RAIL_Status_t
setupRxFifo(RAIL_Handle_t railHandle)
{
  uint16_t rxFifoSize = RAIL_FIFO_SIZE;
  RAIL_Status_t status = RAIL_SetRxFifo(railHandle, sRailRxFifo.fifo, &rxFifoSize);
  if(rxFifoSize != RAIL_FIFO_SIZE) {
    /* We set up an incorrect FIFO size. */
    return RAIL_STATUS_INVALID_PARAMETER;
  }
  if(status == RAIL_STATUS_INVALID_STATE) {
    /* Allow failures due to multiprotocol. */
    return RAIL_STATUS_NO_ERROR;
  }
  return status;
}
/*---------------------------------------------------------------------------*/
static uint8_t
configure_radio_interrupts(void)
{
  RAIL_Status_t rail_status;

  rail_status = RAIL_ConfigEvents(sRailHandle, RAIL_EVENTS_ALL,
                                  RAIL_EVENT_RX_SYNC1_DETECT |
                                  RAIL_EVENT_RX_SYNC2_DETECT |
                                  RAIL_EVENT_RX_ACK_TIMEOUT |
                                  RAIL_EVENT_RX_FRAME_ERROR |
                                  RAIL_EVENT_RX_PACKET_RECEIVED |
                                  RAIL_EVENT_RX_FIFO_OVERFLOW |
                                  RAIL_EVENT_RX_ADDRESS_FILTERED |
                                  RAIL_EVENT_RX_PACKET_ABORTED |
                                  RAIL_EVENT_TX_PACKET_SENT |
                                  RAIL_EVENT_TX_CHANNEL_BUSY |
                                  RAIL_EVENT_TX_ABORTED |
                                  RAIL_EVENT_TX_BLOCKED |
                                  RAIL_EVENT_TX_UNDERFLOW |
                                  RAIL_EVENT_CAL_NEEDED);

  if(rail_status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_ConfigEvents failed, return value: %d\n", rail_status);
    return 0;
  }

  return 1;
}
/*---------------------------------------------------------------------------*/
static void
handle_receive(void)
{
  RAIL_RxPacketHandle_t rx_packet_handle = RAIL_RX_PACKET_HANDLE_INVALID;
  RAIL_RxPacketDetails_t packet_details;
  RAIL_RxPacketInfo_t packet_info;
  RAIL_Status_t rail_status;
  uint16_t length = 0;
  rx_buffer_t *rx_buf;

  rx_packet_handle = RAIL_GetRxPacketInfo(sRailHandle, RAIL_RX_PACKET_HANDLE_OLDEST_COMPLETE, &packet_info);

  if(rx_packet_handle == RAIL_RX_PACKET_HANDLE_INVALID) {
    return;
  }

  packet_details.isAck = false;
  packet_details.timeReceived.timePosition = RAIL_PACKET_TIME_AT_SYNC_END;
  packet_details.timeReceived.totalPacketBytes = 0;

  rail_status = RAIL_GetRxPacketDetails(sRailHandle, rx_packet_handle, &packet_details);
  if(rail_status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("Failed to get packet details\n");
    return;
  }

  length = packet_info.packetBytes - 2;
  LOG_INFO("EFR32 Radio: rcv:%d\n", length);

