tiiuae/contiki-ng/arch/cpu/gecko2/radio/efr32-radio-IEEE802154_GB920MHz.c
  /* skip length byte */
  packet_info.firstPortionData++;
  packet_info.firstPortionBytes--;
  packet_info.packetBytes--;

  /* Skip one more length byte, SUN_FSK */
  packet_info.firstPortionData++;
  packet_info.firstPortionBytes--;
  packet_info.packetBytes--;

  rx_buf = get_empty_rx_buf();
  if(rx_buf != NULL) {
    rx_buf->len = length;

    /* read packet into buffer */
    memcpy(rx_buf->buf, packet_info.firstPortionData,
           packet_info.firstPortionBytes);
    if(packet_info.lastPortionData != NULL) {
      memcpy(rx_buf->buf + packet_info.firstPortionBytes,
             packet_info.lastPortionData,
             packet_info.packetBytes - packet_info.firstPortionBytes);
    }
    rx_buf->rssi = packet_details.rssi;
    rx_buf->lqi = packet_details.lqi;
    rx_buf->timestamp = packet_details.timeReceived.packetTime;
  } else {
    LOG_INFO("EFR32 Radio: Could not allocate rx_buf\n");
  }

  /* After the copy of the packet, the RX packet can be release for RAIL */
  rail_status = RAIL_ReleaseRxPacket(sRailHandle, rx_packet_handle);
  if(rail_status != RAIL_STATUS_NO_ERROR) {
    LOG_WARN("RAIL_ReleaseRxPacket() result:%d\n", rail_status);
  }
}
/*---------------------------------------------------------------------------*/
static void
rail_events_cb(RAIL_Handle_t rail_handle, RAIL_Events_t events)
{
  if(events & (RAIL_EVENT_TX_ABORTED | RAIL_EVENT_TX_BLOCKED | RAIL_EVENT_TX_UNDERFLOW)) {
    tx_status = TX_ERROR;
  }

  if(events & RAIL_EVENT_RX_ACK_TIMEOUT) {
    tx_status = TX_NO_ACK;
  }

  if(events & (RAIL_EVENT_RX_FIFO_OVERFLOW
               | RAIL_EVENT_RX_ADDRESS_FILTERED
               | RAIL_EVENT_RX_PACKET_ABORTED
               | RAIL_EVENT_RX_FRAME_ERROR
               | RAIL_EVENT_RX_PACKET_RECEIVED)) {
    is_receiving = false;
    if(events & RAIL_EVENT_RX_PACKET_RECEIVED) {
      RAIL_HoldRxPacket(rail_handle);
      if(!poll_mode) {
        LOG_INFO("EFR32 Radio: Receive event - poll.\n");
        process_poll(&efr32_radio_process_920);
      }
    }
  }

  if(events & RAIL_EVENT_TX_PACKET_SENT) {
    LOG_INFO("EFR32 Radio: packet sent.\n");
    tx_status = TX_SENT;
  }

  if(events & RAIL_EVENT_TX_CHANNEL_BUSY) {
    tx_status = TX_CHANNEL_BUSY;
  }

  if(events & (RAIL_EVENT_RX_SYNC1_DETECT | RAIL_EVENT_RX_SYNC2_DETECT)) {
    is_receiving = true;
  }

  if(events & RAIL_EVENT_CAL_NEEDED) {
    (void)RAIL_Calibrate(rail_handle, NULL, RAIL_CAL_ALL_PENDING);
  }
}
/*---------------------------------------------------------------------------*/
static int
init(void)
{
  RAIL_Status_t status;
  uint8_t *ext_addr;
  uint16_t short_addr;
  uint16_t allocated_tx_fifo_size;
  uint64_t system_number;

  NVIC_SetPriority(FRC_PRI_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(FRC_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(MODEM_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(RAC_SEQ_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(RAC_RSM_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(BUFC_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(AGC_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(PROTIMER_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  NVIC_SetPriority(SYNTH_IRQn, CORE_INTERRUPT_HIGHEST_PRIORITY);
  
  sl_rail_util_dma_init();
  sl_rail_util_pa_init();
  sl_rail_util_pti_init();
  sl_rail_util_rssi_init();
  sl_rail_util_rf_path_switch_init();
  sl_rail_util_rf_path_init();

  /* Initializes the RAIL core. */
  sRailHandle = RAIL_Init(&rail_config, NULL);
  if(sRailHandle == NULL) {
    LOG_ERR("RAIL_Init failed, return value: NULL\n");
    return 0;
  }

  status = RAIL_InitPowerManager();
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_InitPowerManager failed, return value: %d\n", status);
    return 0;
  }

  status = RAIL_ConfigData(sRailHandle, &data_config);
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_ConfigData failed, return value: %d\n", status);
    return 0;
  }

  status = RAIL_ConfigData(sRailHandle, &data_config);
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_ConfigData failed, return value: %d\n", status);
    return 0;
  }

  status = RAIL_IEEE802154_Init(sRailHandle, &rail_ieee802154_config);
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_IEEE802154_Init failed, return value: %d\n", status);
    return 0;
  }


  /* Configures the channels. */
  const RAIL_ChannelConfig_t *channel_config = NULL;
  channel_config = channelConfigs[SL_RAIL_UTIL_INIT_PROTOCOL_PROPRIETARY_INST0_INDEX];
  (void)RAIL_ConfigChannels(sRailHandle,
                            channel_config,
                            &sl_rail_util_pa_on_channel_config_change);

 /*
 * Initialize RAIL for IEEE802.15.4 features.
 *
 * - Enables IEEE802154 hardware acceleration
 * - Configures RAIL Auto ACK functionality
 * - Configures RAIL Address Filter for 802.15.4 address filtering
 */
 status = RAIL_IEEE802154_Init(sRailHandle, &rail_ieee802154_config);
  if(status != RAIL_STATUS_NO_ERROR) {
    (void)RAIL_IEEE802154_Deinit(sRailHandle);
    LOG_ERR("RAIL_IEEE802154_Init failed, return value: %d\n", status);
    return 0;
  }

  status = RAIL_IEEE802154_ConfigEOptions(sRailHandle,
                                          (RAIL_IEEE802154_E_OPTION_GB868
                                           | RAIL_IEEE802154_E_OPTION_ENH_ACK
                                           | RAIL_IEEE802154_E_OPTION_IMPLICIT_BROADCAST),
                                          (RAIL_IEEE802154_E_OPTION_GB868
                                           | RAIL_IEEE802154_E_OPTION_ENH_ACK
                                           | RAIL_IEEE802154_E_OPTION_IMPLICIT_BROADCAST));

  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_IEEE802154_ConfigEOptions failed, return value: %d\n", status);
    return 0;
  }  

  /*
   * An option to enable/disable 802.15.4G-2012 features needed for GB868.
   * Normally RAIL supports 802.15.4-2003 and -2006 radio configurations 
   * that have the single-byte PHY header allowing frames up to 128 bytes in size.
   * This feature must be enabled for 802.15.4G-2012 or 802.15.4-2015 SUN PHY 
   * radio configurations with the two-byte bit-reversed-length PHY header format.
   */
  status = RAIL_IEEE802154_ConfigGOptions(sRailHandle,
                                          RAIL_IEEE802154_G_OPTION_GB868,
                                          RAIL_IEEE802154_G_OPTION_GB868);

  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_IEEE802154_ConfigGOptions failed, return value: %d\n", status);
    return 0;
  }  

