tiiuae/contiki-ng/arch/cpu/gecko2/radio/efr32-radio-IEEE802154_GB920MHz.c
  /* Initialize RAIL calibration. */
  status = RAIL_ConfigCal(sRailHandle,
                          0U
                          | (0
                             ? RAIL_CAL_TEMP : 0U)
                          | (0
                             ? RAIL_CAL_ONETIME : 0U));
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_ConfigCal failed, return value: %d\n", status);
    return 0;
  }

  /* Config events. */
  if(!configure_radio_interrupts()) {
    return 0;
  }

  system_number = SYSTEM_GetUnique();

  ext_addr = (uint8_t *)&system_number;
  short_addr = ext_addr[7];
  short_addr |= ext_addr[6] << 8;

  NETSTACK_RADIO.set_value(RADIO_PARAM_PAN_ID, IEEE802154_PANID);
  NETSTACK_RADIO.set_value(RADIO_PARAM_16BIT_ADDR, short_addr);
  NETSTACK_RADIO.set_object(RADIO_PARAM_64BIT_ADDR, &system_number, sizeof(system_number));

  /* Setup Rx Fifo */
  status = setupRxFifo(sRailHandle);
  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("setupRxFifo failed, return value: %d\n", status);
    return 0;
  }

  /* Setup Tx Fifo */
  allocated_tx_fifo_size = RAIL_SetTxFifo(sRailHandle, sRailTxFifo.fifo,
                                          0u, RAIL_FIFO_SIZE);

  if(allocated_tx_fifo_size != RAIL_FIFO_SIZE) {
    LOG_ERR("RAIL_SetTxFifo() failed to allocate a large enough fifo"
            " (%d bytes instead of %d bytes)\n",
            allocated_tx_fifo_size, RAIL_FIFO_SIZE);
    return 0;
  }

  if(PTI_ENABLED) {
    status = RAIL_SetPtiProtocol(sRailHandle, RAIL_PTI_PROTOCOL_802154);
    if(status != RAIL_STATUS_NO_ERROR) {
      LOG_ERR("RAIL_SetPtiProtocol() status: %d failed\n", status);
      return 0;
    }
    status = RAIL_EnablePti(sRailHandle, PTI_ENABLED);
    if(status != RAIL_STATUS_NO_ERROR) {
      LOG_ERR("RAIL_EnablePti() status: %d failed\n", status);
      return 0;
    }
  }

  process_start(&efr32_radio_process_920, NULL);

  return 0;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
get_value(radio_param_t param, radio_value_t *value)
{
  if(!value) {
    return RADIO_RESULT_INVALID_VALUE;
  }
  switch(param) {
  case RADIO_PARAM_PAN_ID:
    *value = panid;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_CHANNEL:
    *value = channel;
    return RADIO_RESULT_OK;
  case RADIO_CONST_MAX_PAYLOAD_LEN:
    *value = RAIL_FIFO_SIZE - 4; /* -4 ? 127 max ? */
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RX_MODE:
    *value = 0;
    if(!rail_ieee802154_config.promiscuousMode) {
      *value |= RADIO_RX_MODE_ADDRESS_FILTER;
    }
    if(rail_ieee802154_config.ackConfig.enable) {
      *value |= RADIO_RX_MODE_AUTOACK;
    }
    if(poll_mode) {
      *value |= RADIO_RX_MODE_POLL_MODE;
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_TX_MODE:
    *value = 0;
    if(send_on_cca) {
      *value |= RADIO_TX_MODE_SEND_ON_CCA;
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_LAST_RSSI:
    *value = last_rssi;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_LAST_LINK_QUALITY:
    *value = last_lqi;
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RSSI:
  {
    int16_t rssi_value = RAIL_GetRssi(sRailHandle, true);
    if(rssi_value != RAIL_RSSI_INVALID) {
      /* RAIL_RxGetRSSI() returns value in quarter dBm (dBm * 4) */
      *value = rssi_value / 4;
      return RADIO_RESULT_OK;
    }
    return RADIO_RESULT_ERROR;
  }
  }
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_value(radio_param_t param, radio_value_t value)
{
  switch(param) {
  case RADIO_PARAM_CHANNEL:
    if(value < CHANNEL_MIN ||
       value > CHANNEL_MAX) {
      return RADIO_RESULT_INVALID_VALUE;
    }
    channel = value;
    /* Start receiving on that channel. */
    const RAIL_Status_t status = RAIL_StartRx(sRailHandle, channel, NULL);
    if(status != RAIL_STATUS_NO_ERROR) {
      LOG_ERR("Could not start RX on channel %d\n", channel);
     return RADIO_RESULT_ERROR;
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_PAN_ID:
    panid = value & 0xffff;
    (void)RAIL_IEEE802154_SetPanId(sRailHandle, panid, 0);
    return RADIO_RESULT_OK;
  case RADIO_PARAM_16BIT_ADDR:
    (void)RAIL_IEEE802154_SetShortAddress(sRailHandle, value & 0xFFFF, 0);
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RX_MODE:
    if(value & ~(RADIO_RX_MODE_ADDRESS_FILTER |
                 RADIO_RX_MODE_AUTOACK |
                 RADIO_RX_MODE_POLL_MODE)) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    rail_ieee802154_config.ackConfig.enable = (value & RADIO_RX_MODE_AUTOACK) != 0;
    rail_ieee802154_config.promiscuousMode = (value & RADIO_RX_MODE_ADDRESS_FILTER) == 0;
    poll_mode = (value & RADIO_RX_MODE_POLL_MODE) != 0;

    if(!rail_ieee802154_config.ackConfig.enable) {
      RAIL_StateTransitions_t transitions = {
        .error = RAIL_RF_STATE_RX,
        .success = RAIL_RF_STATE_RX,
      };
      RAIL_SetTxTransitions(sRailHandle, &transitions);
      RAIL_SetRxTransitions(sRailHandle, &transitions);
    }
    (void)RAIL_ConfigAutoAck(sRailHandle, &rail_ieee802154_config.ackConfig);
    (void)RAIL_IEEE802154_SetPromiscuousMode(sRailHandle, rail_ieee802154_config.promiscuousMode);
    (void)configure_radio_interrupts();

    return RADIO_RESULT_OK;
  case RADIO_PARAM_TX_MODE:
    if(value & ~(RADIO_TX_MODE_SEND_ON_CCA)) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    send_on_cca = (value & RADIO_TX_MODE_SEND_ON_CCA) != 0;
    return RADIO_RESULT_OK;
  }
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
get_object(radio_param_t param, void *dest, size_t size)
{
  if(param == RADIO_PARAM_LAST_PACKET_TIMESTAMP) {
    if(size != sizeof(rtimer_clock_t) || !dest) {
      return RADIO_RESULT_INVALID_VALUE;
    }
    *(rtimer_clock_t *)dest = last_rx_time;
    return RADIO_RESULT_OK;
  }

  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_object(radio_param_t param, const void *src, size_t size)
{
  if(param == RADIO_PARAM_64BIT_ADDR) {
    if(size != 8 || src == NULL) {
      return RADIO_RESULT_INVALID_VALUE;
    }
    (void)RAIL_IEEE802154_SetLongAddress(sRailHandle, src, 0);
    return RADIO_RESULT_OK;
  }
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
static int
channel_clear(void)
{
  if(RAIL_GetRssi(sRailHandle, true) / 4 > cca_threshold) {
    return 0;
  }
  return 1;
}
/*---------------------------------------------------------------------------*/
static int
prepare(const void *payload, unsigned short payload_len)
{
  uint8_t *data = (uint8_t *)payload;
  int written = 0;

