tiiuae/contiki-ng/arch/cpu/gecko2/radio/efr32-radio-IEEE802154_GB920MHz.c
  /* Pack frame */
  uint16_t packet_size = 0U;
  uint8_t tx_frame_buffer[256];
  uint8_t fcsType = 0;    // WISUN_FSK_FCS_TYPE;
  uint8_t whitening = 0;  // WISUN_FSK_WHITENING;
  int16_t status = sl_flex_802154_packet_pack_sunfsk_2bytes_data_frame(fcsType,
                                                      whitening,
                                                      payload_len,
                                                      data,
                                                      &packet_size,
                                                      tx_frame_buffer);
  if(status != SL_FLEX_802154_PACKET_OK) {
    LOG_ERR("802154_packet_pack_sunfsk status: %d failed\n", status);
  }
  written = RAIL_WriteTxFifo(sRailHandle, tx_frame_buffer, packet_size, true);

  LOG_INFO("EFR32 Radio - wrote %d bytes to TX fifo\n", written);

  if(!(poll_mode) && (data[0] & IEEE802154_ACK_REQUEST)) {
    txOptions = RAIL_TX_OPTION_WAIT_FOR_ACK;
  } else {
    txOptions = RAIL_TX_OPTIONS_DEFAULT;
  }

  return RADIO_TX_OK;
}
/*---------------------------------------------------------------------------*/
static int
transmit(unsigned short transmit_len)
{
  uint8_t ret = RADIO_TX_OK;
  /* CSMA/CA configuration structure for IEEE 502.15.4g */
  RAIL_CsmaConfig_t csmaConfig_sub = {
    .csmaMinBoExp = 3,      // 2^3-1 for 0..7 backoffs on 1st try
    .csmaMaxBoExp = 5,      // 2^5-1 for 0..31 backoffs on 3rd+ tries
    .csmaTries = 5,         // 5 tries overall (4 re-tries)
    .ccaThreshold = -81,    // 10 dB above sensitivity
    .ccaBackoff = 1160,     // 1ms+ ccaDuration
    .ccaDuration = 160,     // 8 symbols at 20 us/symbol
    .csmaTimeout = 0,       // no timeout
  };
  RAIL_Status_t status;

  LOG_INFO("EFR32 Radio: Sending packet %d bytes\n", transmit_len);

  tx_status = TX_SENDING;

  if(send_on_cca) {
    status = RAIL_StartCcaCsmaTx(sRailHandle,
                                 channel,
                                 txOptions,
                                 &csmaConfig_sub,
                                 NULL);
  } else {
    status = RAIL_StartTx(sRailHandle,
                          channel,
                          txOptions,
                          NULL);
  }

  if(status != RAIL_STATUS_NO_ERROR) {
    LOG_ERR("RAIL_Start***Tx status: %d failed\n", status);
    tx_status = TX_IDLE;
    return RADIO_TX_ERR;
  }

  if(poll_mode) {
    /* Wait until TX operation finishes or timeout */
    const uint16_t frame_length = transmit_len + RADIO_PHY_HEADER_LEN + RADIO_PHY_OVERHEAD;
    RTIMER_BUSYWAIT_UNTIL((tx_status != TX_SENDING),
                          US_TO_RTIMERTICKS(RADIO_BYTE_AIR_TIME * frame_length + 300));
  } else {
    /* Wait for the end of transmission. */ // Loop ?
    while(tx_status == TX_SENDING);
  }

  if(tx_status == TX_SENT) {
    LOG_INFO("EFR32: OK - packet sent.\n");
  } else {
    LOG_INFO("EFR32: TX error %d\n", tx_status);
  }

  /* Always IDLE after transmission. */
  tx_status = TX_IDLE;

  return ret;
}
/*---------------------------------------------------------------------------*/
static int
send(const void *payload, unsigned short payload_len)
{
  int ret;
  ret = prepare(payload, payload_len);
  if(ret) {
    return ret;
  }
  return transmit(payload_len);
}
/*---------------------------------------------------------------------------*/
static int
on(void)
{
  return 1;
}
/*---------------------------------------------------------------------------*/
static int
off(void)
{
  return 1;
}
/*---------------------------------------------------------------------------*/
static int
receiving_packet(void)
{
  return is_receiving;
}
/*---------------------------------------------------------------------------*/
static int
read(void *buf, unsigned short bufsize)
{
  rx_buffer_t *rx_buf;
  int len;

  handle_receive();

  rx_buf = get_full_rx_buf();
  if(!rx_buf) {
    return 0;
  }
  LOG_INFO("EFR32 Radio Read: %d\n", rx_buf->len);
  len = rx_buf->len;
  /* Convert from rail time domain to rtimer domain. */
  last_rx_time = RTIMER_NOW() - US_TO_RTIMERTICKS(RAIL_GetTime() - rx_buf->timestamp);
  memcpy(buf, rx_buf->buf, len);
  last_rssi = rx_buf->rssi;
  last_lqi = rx_buf->lqi;
  if(!poll_mode) {
    packetbuf_set_attr(PACKETBUF_ATTR_RSSI, rx_buf->rssi);
    packetbuf_set_attr(PACKETBUF_ATTR_LINK_QUALITY, rx_buf->lqi);
  }
  free_rx_buf(rx_buf);
  return len;
}
/*---------------------------------------------------------------------------*/
static int
pending_packet(void)
{
  handle_receive();

  return has_packet();
}
/*---------------------------------------------------------------------------*/
PROCESS_THREAD(efr32_radio_process_920, ev, data)
{
  int len;

  PROCESS_BEGIN();

  while(1) {
    PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);

    if(pending_packet()) {
      packetbuf_clear();
      len = read(packetbuf_dataptr(), PACKETBUF_SIZE);

      if(len > 0) {
        packetbuf_set_datalen(len);
        NETSTACK_MAC.input();
        /* Poll again to check if there is more to read out. */
        process_poll(&efr32_radio_process_920);
      }
    }
  }
  PROCESS_END();
}
/*---------------------------------------------------------------------------*/
const struct radio_driver efr32_radio_driver_IEEE802154_GB920MHz = {
  init,
  prepare,
  transmit,
  send,
  read,
  channel_clear,
  receiving_packet,
  pending_packet,
  on,
  off,
  get_value,
  set_value,
  get_object,
  set_object
};
/*---------------------------------------------------------------------------*/